function [ I_cap ] = Gauss_Integral_2d( f, n )
% 一维高斯积分
% 输入: f-被积函数或矩阵; n-积分点数(4/9) f必须是关于xi,eta的函数，因此输入时务必注意
% 输出: I_cap-被积函数结果
I_cap = 0;

if n == 4
    point_x = [-0.57735 -0.57735 0.57735 0.57735];
    point_y = [-0.57735 0.57735 -0.57735 0.57735];
    H = [1 1 1 1];
    for i = 1:n
        xi = point_x(i);
        eta = point_y(i);
        I_cap = I_cap + H(i)*eval(f);
    end
    
elseif n == 9
    point_x = [-0.774597 -0.774597 -0.774597 0 0 0 0.774597 0.774597 0.774597];
    point_y = [-0.774597 0 0.774597 -0.774597 0 0.774597 -0.774597 0 0.774597];
    H = [0.308642 0.493827 0.308642 0.493827 0.790123 0.493827 0.308642 0.493827 0.308642];
    
    for i = 1:n
        xi = point_x(i);
        eta = point_y(i);
        I_cap = I_cap + H(i)*eval(f);
    end
end
    
end


