%作业1，单个单元
p1 = [-0.5,-0.5]; p2 = [0.5,-0.5]; p3 = [0.5,0.5]; p4 = [-0.5,0.5];   %四个结点的坐标，1号必须是左下的，逆时针
E = 200e9;  miu = 0.3;  t = 0.01;%E miu t为梁的弹性模量，泊松比，厚度
k1 = Ban_GangDu(E,miu,t,p1,p2,p3,p4);
disp('k1 =')
vpa(k1,4)   %要是太大就自己除一下吧...

k2 = k1; k3 = k1; k4 = k1;      %本题特例，各单元都一样

contri_1 = [ 1 2 3 4 5 6 13 14 15 10 11 12];
contri_2 = [ 4 5 6 7 8 9 16 17 18 13 14 15];
contri_3 = [ 13 14 15 16 17 18 25 26 27 22 23 24];
contri_4 = [ 10 11 12 13 14 15 22 23 24 19 20 21];
k = JuZhenHeBing(27,k1,contri_1,k2,contri_2,k3,contri_3,k4,contri_4,0,0);   %矩阵合并

disp('k =')
vpa(k,4)   %要是太大就自己除一下吧...

delta_k = [0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0]';       %已知的位移大小
delta_uk = [13 14 15];     %未知位移对应的自由度
F_k = [-400 0 0]';     %已知的外载荷大小
F_uk = [1 2 3 4 5 6 7 8 9 10 11 12 16 17 18 19 20 21 22 23 24 25 26 27];           %未知的外载荷对应的自由度   一般来说，两个uk拼起来刚好齐了所有自由度

[delta,F] = FangChengQiuJie(k, delta_k, delta_uk, F_k, F_uk);
disp('位移delta=');vpa(delta,4)
disp('外载荷F=');vpa(F,4)                              %求解并以四位有效数字显示

z = -0.005;
x = 0.5; y = 0.5;    %要计算的点在板单元中的局部坐标
D = Ban_D(E,miu);
B = Ban_B(x,y,p1,p2,p3,p4);
delta_1 = [0 0 0 0 0 0 -5.1705e-4 0 0 0 0 0]';  %单元1的节点位移
sigma = z*D*B*delta_1;
disp('σ=');vpa(sigma,4)   %σx σy τxy